ocaml-book/ocaml-book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml 杂记</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml 杂记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8c4c9d5">1. CS3110 练习题</a></li>
<li><a href="#orga98bf60">2. opam包管理器</a></li>
<li><a href="#org9555ff7">3. utop交互式解释器</a>
<ul>
<li><a href="#orgd8f5c75">3.1. Exit utop</a></li>
</ul>
</li>
<li><a href="#orgbeaac37">4. 配置Emacs支持ocaml | Configure EMACS supports Ocaml</a></li>
<li><a href="#org2636411">5. 编译ocamlc</a>
<ul>
<li><a href="#org1e39d44">5.1. main()函数？</a></li>
<li><a href="#org3c31da1">5.2. 构建系统Dune</a></li>
</ul>
</li>
<li><a href="#org4a677e8">6. ocaml的显著差别</a>
<ul>
<li><a href="#org090277c">6.1. 递归函数要用 <code>rec</code> 标记</a></li>
<li><a href="#org16f90e6">6.2. 严格区分整数和浮点数的运算：</a></li>
<li><a href="#org5ab5344">6.3. 连接字符串: 用 <code>^</code></a></li>
<li><a href="#orgb3f7432">6.4. 带类型注释的函数定义</a></li>
</ul>
</li>
<li><a href="#orgf9742ea">7. let 不是表达式</a></li>
<li><a href="#org02a1eb8">8. let &#x2026; in &#x2026;表达式</a></li>
<li><a href="#orga1fa839">9. 运算符</a>
<ul>
<li><a href="#orgd9e0666">9.1. 用括号定义标点符号</a></li>
<li><a href="#org7b692da">9.2. 运算符@@ 分隔开函数和参数</a></li>
<li><a href="#org0e3a702">9.3. 运算符|&gt; 管道符</a></li>
<li><a href="#orgc16561d">9.4. 文档</a></li>
<li><a href="#orgf003b3a">9.5. 打印</a>
<ul>
<li><a href="#org1b578bd">9.5.1. 格式化输出</a></li>
<li><a href="#orgaf5fef8">9.5.2. 格式化字符串</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2bea36f">10. list</a>
<ul>
<li><a href="#org0c325d7">10.1. 创建list</a></li>
<li><a href="#org129d536">10.2. 用 <code>@</code> 连接两个list</a></li>
<li><a href="#org98446cf">10.3. 通过模式匹配 访问元素</a></li>
<li><a href="#org69c6430">10.4. list的不可变</a></li>
</ul>
</li>
<li><a href="#org8be9ede">11. 模式匹配</a>
<ul>
<li><a href="#org2621a25">11.1. 模式匹配的求值规则（动态语义）</a></li>
<li><a href="#org58b7bdc">11.2. 模式匹配静态语义</a>
<ul>
<li><a href="#org85dd2dd">11.2.1. 类型推断/检查</a></li>
<li><a href="#orga796309">11.2.2. match的分支是否完整包含了所有情况</a></li>
<li><a href="#orga2a4bf8">11.2.3. match中是否包含无用分支</a></li>
</ul>
</li>
<li><a href="#org30f8666">11.3. 一些关于list的模式</a></li>
<li><a href="#orgb1451e2">11.4. 用于函数定义的简化模式匹配</a></li>
<li><a href="#org2066c6a">11.5. 更多模式</a>
<ul>
<li><a href="#org609df90">11.5.1. 匹配上模式并满足when的条件</a></li>
</ul>
</li>
<li><a href="#org560486c">11.6. let in 中的模式匹配</a></li>
<li><a href="#org8e4aade">11.7. 元组的模式匹配</a></li>
</ul>
</li>
<li><a href="#orgef877bb">12. 尾递归</a></li>
<li><a href="#org7baf93e">13. 变体 | Variants</a>
<ul>
<li><a href="#org2f0b976">13.1. 额外携带数据的Variant也被叫做代数数据类型</a></li>
<li><a href="#orgbb4b115">13.2. 对Variant使用模式匹配的要点</a></li>
<li><a href="#org2a46390">13.3. Variant的递归定义</a></li>
<li><a href="#org257ec72">13.4. <code>and</code> 关键字使类型定义可以是互相递归的</a></li>
<li><a href="#org15d9308">13.5. Variants的参数多态</a></li>
<li><a href="#org6239765">13.6. 多态Variant/匿名Variant</a></li>
</ul>
</li>
<li><a href="#orgcf0d406">14. 和match天生一对的Options= Some/None</a></li>
<li><a href="#orge27b2ba">15. 列表推导 | List Comprehensions</a></li>
<li><a href="#orgd854086">16. OUnit2</a>
<ul>
<li><a href="#org20f7ae8">16.1. 打印测试用例出错时的值</a></li>
<li><a href="#orge93ef79">16.2. 测试是否发出了异常</a></li>
</ul>
</li>
<li><a href="#orga97f8d5">17. Records &amp; Tuples</a>
<ul>
<li><a href="#org5b788b1">17.1. Record定义</a></li>
<li><a href="#org0b4397f">17.2. 访问Record的字段</a>
<ul>
<li><a href="#org3344075">17.2.1. 通过 <code>R.field</code></a></li>
<li><a href="#org6d11841">17.2.2. 通过模式匹配</a></li>
</ul>
</li>
<li><a href="#org7837bdc">17.3. 从旧record中创建新record</a></li>
<li><a href="#org9feebd5">17.4. Tuple的定义</a></li>
</ul>
</li>
<li><a href="#orgd944cc7">18. 类型别名</a></li>
<li><a href="#org3fb8fed">19. 异常</a>
<ul>
<li><a href="#org931229d">19.1. 定义一个新的异常</a></li>
<li><a href="#orgccd12bd">19.2. 抛出异常</a>
<ul>
<li><a href="#orgba2194c">19.2.1. raise</a></li>
<li><a href="#org0ac3202">19.2.2. failwith</a></li>
</ul>
</li>
<li><a href="#orga4af236">19.3. 捕获并处理异常</a></li>
</ul>
</li>
<li><a href="#orgd53bc30">20. 定义二叉树类型 Binary Tree</a>
<ul>
<li><a href="#org177eb2b">20.1. 用Tuples表示 | representation with tuples</a>
<ul>
<li><a href="#org226ced0">20.1.1. 定义</a></li>
<li><a href="#orgcf5c298">20.1.2. 创建对象</a></li>
<li><a href="#org4987d64">20.1.3. 使用</a></li>
</ul>
</li>
<li><a href="#orgea07192">20.2. 用Records表示 | representation with records</a>
<ul>
<li><a href="#org46130a2">20.2.1. 定义</a></li>
<li><a href="#org9c06e68">20.2.2. 创建对象</a></li>
<li><a href="#org44a5441">20.2.3. 使用方法，匹配tree对象</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5861bed">21. 定义自然数类型 natural numbers</a>
<ul>
<li><a href="#org9f952ae">21.1. 定义 nat</a></li>
<li><a href="#orgbaf26df">21.2. 创建nat对象</a></li>
<li><a href="#org694058b">21.3. 操作自然数</a>
<ul>
<li><a href="#orgd4d94fe">21.3.1. 是否为0</a></li>
<li><a href="#org144a75b">21.3.2. 前驱？</a></li>
<li><a href="#org48c1d96">21.3.3. 加法运算</a></li>
<li><a href="#org05a9e31">21.3.4. int和nat的相互转换</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org8c4c9d5" class="outline-2">
<h2 id="org8c4c9d5"><span class="section-number-2">1.</span> CS3110 练习题</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./ch2/ex.html">Ch2</a></li>
<li><a href="./ch3/exercises.html">Ch3</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga98bf60" class="outline-2">
<h2 id="orga98bf60"><span class="section-number-2">2.</span> opam包管理器</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>opam install XX</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">opam install -y utop odoc ounit2 qcheck bisect_ppx menhir ocaml-lsp-server ocamlformat ocamlformat-rpc
</pre>
</div>
</div>
</div>

<div id="outline-container-org9555ff7" class="outline-2">
<h2 id="org9555ff7"><span class="section-number-2">3.</span> utop交互式解释器</h2>
<div class="outline-text-2" id="text-3">
<p>
每次启动utop都会自动加载 <code>.ocamlinit</code> 文件，它会自动执行脚本，
使得不用每次都手动加载库
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">#</span>use <span style="color: #7bc275;">"topfind"</span><span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">#</span>thread<span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">#</span>require <span style="color: #7bc275;">"core.top"</span><span style="color: #ff4500;">;;</span>

</pre>
</div>
</div>

<div id="outline-container-orgd8f5c75" class="outline-3">
<h3 id="orgd8f5c75"><span class="section-number-3">3.1.</span> Exit utop</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">#</span>quit<span style="color: #ff4500;">;;</span> 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #C57BDB;">exit</span> 0<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgbeaac37" class="outline-2">
<h2 id="orgbeaac37"><span class="section-number-2">4.</span> 配置Emacs支持ocaml | Configure EMACS supports Ocaml</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-ocaml">opam install tuareg ocp<span style="color: #f0e68c;">-</span>indent merlin
opam install user<span style="color: #f0e68c;">-</span>setup
opam user<span style="color: #f0e68c;">-</span>setup install
</pre>
</div>
</div>
</div>


<div id="outline-container-org2636411" class="outline-2">
<h2 id="org2636411"><span class="section-number-2">5.</span> 编译ocamlc</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sh">ocamlc -o test.byte test.ml 
</pre>
</div>
<p>
这和gcc类似，不同的是它还会产生中间文件： <code>test.cmi test.cmo</code>
</p>
</div>


<div id="outline-container-org1e39d44" class="outline-3">
<h3 id="org1e39d44"><span class="section-number-3">5.1.</span> main()函数？</h3>
<div class="outline-text-3" id="text-5-1">
<p>
ocaml中没有专门的main函数，文件（指的是dune中name命令指定的那个）中最后一个函数定义将作为整个程序的入口。
</p>
</div>
</div>

<div id="outline-container-org3c31da1" class="outline-3">
<h3 id="org3c31da1"><span class="section-number-3">5.2.</span> 构建系统Dune</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><p>
用dune创建项目根目录 Create a project root directory with dune
</p>
<div class="org-src-container">
<pre class="src src-sh">dune init project dirname
</pre>
</div></li>

<li><p>
create a file named dune in the project root directory
</p>

<div class="org-src-container">
<pre class="src src-elisp">(executable
  (name XX) <span style="color: #62686E;">;;</span><span style="color: #62686E;">XX&#20026;main&#20989;&#25968;&#25152;&#22312;&#25991;&#20214;&#30340;&#21517;&#23383;</span>
  <span style="color: #62686E;">;;</span><span style="color: #62686E;">(libraries yyy) ;; erung: ounit2</span>
  )
</pre>
</div></li>

<li><p>
Generate executable file
</p>

<div class="org-src-container">
<pre class="src src-sh">dune build XX.exe 
</pre>
</div></li>

<li><p>
run project
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #62686E;"># </span><span style="color: #62686E;">Manually</span>
./_build/default/XX.exe

<span style="color: #62686E;"># </span><span style="color: #62686E;">automatic</span>
dune exec ./XX.exe
</pre>
</div></li>

<li><p>
Clean up the _build directory
</p>
<div class="org-src-container">
<pre class="src src-sh">dune clean <span style="color: #62686E;"># </span><span style="color: #62686E;">remove the _build directory </span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org4a677e8" class="outline-2">
<h2 id="org4a677e8"><span class="section-number-2">6.</span> ocaml的显著差别</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org090277c" class="outline-3">
<h3 id="org090277c"><span class="section-number-3">6.1.</span> 递归函数要用 <code>rec</code> 标记</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">append</span><span style="color: #DFDFDF;"> lst1 lst2</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> lst1 <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> lst2
  <span style="color: #f0e68c;">|</span> h <span style="color: #f0e68c;">::</span> t <span style="color: #f0e68c;">-&gt;</span> h <span style="color: #f0e68c;">::</span> <span style="color: #f0e68c;">(</span>append t lst2 <span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org16f90e6" class="outline-3">
<h3 id="org16f90e6"><span class="section-number-3">6.2.</span> 严格区分整数和浮点数的运算：</h3>
<div class="outline-text-3" id="text-6-2">
<p>
int： <code>0 + - * /  abs</code> 
</p>

<p>
float:  ~0. +. -. *. /. ~
</p>
</div>
</div>


<div id="outline-container-org5ab5344" class="outline-3">
<h3 id="org5ab5344"><span class="section-number-3">6.3.</span> 连接字符串: 用 <code>^</code></h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"hello"</span> <span style="color: #f0e68c;">^</span> <span style="color: #7bc275;">"world"</span> 
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb3f7432" class="outline-3">
<h3 id="orgb3f7432"><span class="section-number-3">6.4.</span> 带类型注释的函数定义</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">func</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">a</span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">int</span><span style="color: #f0e68c;">)</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">b</span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;"> float</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">string</span><span style="color: #62686E;">(*</span><span style="color: #62686E;">&#36820;&#22238;&#20540;</span><span style="color: #62686E;">*)</span> <span style="color: #f0e68c;">=</span>
 <span style="color: #f0e68c;">...</span>
</pre>
</div>
</div>
</div>
</div>
