ocaml-book/ocaml-book.org
* let 不是表达式


#+begin_src ocaml

utop # let x = 3;;
val x : int = 3

utop # (fun x y -> x * y);;
- : int -> int -> int = <fun>

utop # (fun x y -> x * y) 4 5;;
- : int = 20

utop # let multf x y = x *. y;;
val multf : float -> float -> float = <fun>

utop # multf 1. 4.;;
- : float = 4.
#+end_src

* let ... in ...表达式
在utop环境下，所有的let定义都会被转化成层层嵌套的let..in..表达式。
因此在表面上好像是支持了改变变量的值。


There must be parentheses here:
#+begin_src ocaml
utop # let a = 19 in (fun x -> x + a)  19;;
- : int = 38
#+end_src


本质上在ocaml中不存在多参函数，所谓的多参函数只是语法糖：

#+begin_src ocaml
utop # let multargs = fun x -> (fun y -> ( fun z -> x+y+z )) ;;
val multargs : int -> int -> int -> int = <fun>

utop # multargs 1 2 3 ;;
- : int = 6

utop # let same_as_multargs x y z = x+y+z ;;
val same_as_multargs : int -> int -> int -> int = <fun>

utop # same_as_multargs 1 2 3;;
- : int = 6
#+end_src



范型：带撇的类型名 'a  'b 
#+begin_src ocaml
  utop # let foo = fun (n : int ) (x : 'a) (y : 'a) ->  if n > 0 then x else y ;;
  val foo : int -> 'a -> 'a -> 'a = <fun>

  utop # foo -1 "hello" "fuck" ;;
  Error: This expression has type int -> 'a -> 'a -> 'a
  but an expression was expected of type int

  utop # foo 3 "hello" "fuck" ;;
  - : string = "hello"

  utop # foo (-1)  "hello" "fuck" ;;
  - : string = "fuck"
#+end_src


* 运算符

** 用括号定义标点符号 


** 运算符@@ 分隔开函数和参数

主要是为了避免空格分割导致参数的识别不正常：
#+begin_src ocaml
utop[3]> succ 3;;
- : int = 4
utop[4]> succ 1 * 4 ;;
- : int = 8
utop[5]> succ (1 * 4) ;;
- : int = 5
utop[6]> succ @@ 1 * 4;;
- : int = 5
#+end_src

