ocaml-book/ocaml-book.org
** list的不可变

在ocaml中，所有变量都是immutable，也就是无法被原地修改的。对list来说，只有被改变的元素才会被拷贝，而未改变的部分是共享的，不会发生额外的拷贝。

eg：
#+begin_src ocaml
  let incr_first (lst : int list) : int list =
    match lst with
    |[] -> []
    |h::t -> (h+1) :: t
  ;;
  
#+end_src











* 模式匹配

~_~ 是通配符，不会和值进行绑定。

在模式匹配中主要做了两件事情：

+ 判断模式和给定的值是否匹配
+ 决定值的那些部分可以和模式中的变量名进行绑定
  我们用 ~h -> 1~ 这样的写法表示变量绑定：变量h的值为1

用这个记号来看模式：

+ 模式x能匹配上任何value：  ~x->value~
+ 模式 ~_~ 能和任何值匹配，但不进行绑定。
+ 模式 ~[]~ 匹配上空list ~[]~，它也没有绑定。
+ 模式 ~[p1;...pn]~ 能匹配上形如 ~[v1;...vn]~ 的值，并且有 ~pi->vi~ .

** 模式匹配的求值规则（动态语义）

#+begin_src ocaml
  match e with
  | p1 -> e1
    ...
  | pn -> en
  ;;
#+end_src

+ 将表达式 ~e~ 求值为 ~v~ 
+ 将v分别和 ~p1~ ... ~pn~ 进行匹配。
+ 若v无法和任何模式匹配上，则会抛出 ~Match_failure~ 异常。
+ 否则，在第一个和v成功匹配的模式 ~pi~ 处停下，并用绑定 ~pi -> v~ 将  ~ei~ 中的 ~pi~ 替换掉，得到新的表达式 ~e'~
+ 对表达式 ~e'~ 求值为 ~v'~
+ 整个match表达式的值为 ~v'~

** 模式匹配静态语义

*** 类型推断/检查
若 ~e : ta~ ，且  ~pi:ta~ ,  ~ei:tb~ , 则有：
 ~match表达式 : tb~ 

*** match的分支是否完整包含了所有情况
#+begin_src
[partial-match]: this pattern-matching is not exhaustive.
#+end_src
这种警告会在分支未完全覆盖可能出现的所有模式时发出：
#+begin_src ocaml
  let head lst =
    match lst with
    | h::_ -> h
 (* | [] -> faliwith  "empty list"  *)
  ;;
#+end_src


*** match中是否包含无用分支
#+begin_src ocaml
  let head lst =
  match lst with
    | h::t -> h
    | [x] -> x
    | [] -> 0
  ;;
#+end_src

因为模式h::t已经包括了模式[x]的情况，因此这时会发出警告：
#+begin_src
[redundant-case]: this match case is unused.
#+end_src

但稍微调整一下分支的顺序，就能使这个例子的警告消失：
#+begin_src ocaml
  let head lst =
  match lst with
    | [x] -> x
    | h::t -> h
    | [] -> 0
  ;;
#+end_src




** 一些关于list的模式

#+begin_src ocaml
  (* 至少含3个元素的list *)
  _::_::_::_
  (* 正好有两个元素的list *)
  _::_::[] 
#+end_src

** 用于函数定义的简化模式匹配

+ 最后一个参数是要进行匹配的，需要省略不写.
+ 用 ~function~ 代替 ~match xx with~ .

#+begin_src ocaml
  let rec sum = function
    | [] ->
    | h::t -> h + sum t
  ;;

  let rec sum lst =
    match lst with
    | [] -> 0
    | h::t -> h + sum t
  ;;
#+end_src

** 更多模式

*** 匹配上模式并满足when的条件

~p when e~ : 当和模式p匹配且e的值为true
#+begin_src ocaml 
let first_zero = function 
| [] -> true 
| h::t when h = 0 -> true 
| _ -> false 
;;
#+end_src

#+begin_src ocaml 
  let number_or_letter = function 
    |'A' .. 'Z' | 'a' .. 'z' -> "letter" 
    | '0' .. '9' -> "number"
    | _ -> "??" 
  ;;
#+end_src
这里有两个模式，一个是关于字符范围的，另一个是表示 OR 的。

~'A' .. 'Z'~ 表示从A-Z的任意一个字符。
~|~ 表示或

** let in 中的模式匹配
在语法中
~let p=e in e1~
p可以是模式，而不仅仅是一个标识符：

#+begin_src ocaml
  let (a,b) = (1, 'c' ) in
  Printf.printf "%i,%c %!" a b
  ;;
#+end_src

