ocaml-book/ocaml-book.html






<div id="outline-container-org69c6430" class="outline-3">
<h3 id="org69c6430"><span class="section-number-3">10.4.</span> list的不可变</h3>
<div class="outline-text-3" id="text-10-4">
<p>
在ocaml中，所有变量都是immutable，也就是无法被原地修改的。对list来说，只有被改变的元素才会被拷贝，而未改变的部分是共享的，不会发生额外的拷贝。
</p>

<p>
eg：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">incr_first</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">lst </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;"> int list</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">int list</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">[]</span>
  <span style="color: #f0e68c;">|</span>h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">(</span>h<span style="color: #f0e68c;">+</span>1<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">::</span> t
<span style="color: #ff4500;">;;</span>

</pre>
</div>
</div>
</div>
</div>











<div id="outline-container-org8be9ede" class="outline-2">
<h2 id="org8be9ede"><span class="section-number-2">11.</span> 模式匹配</h2>
<div class="outline-text-2" id="text-11">
<p>
<code>_</code> 是通配符，不会和值进行绑定。
</p>

<p>
在模式匹配中主要做了两件事情：
</p>

<ul class="org-ul">
<li>判断模式和给定的值是否匹配</li>
<li>决定值的那些部分可以和模式中的变量名进行绑定
我们用 <code>h -&gt; 1</code> 这样的写法表示变量绑定：变量h的值为1</li>
</ul>

<p>
用这个记号来看模式：
</p>

<ul class="org-ul">
<li>模式x能匹配上任何value：  <code>x-&gt;value</code></li>
<li>模式 <code>_</code> 能和任何值匹配，但不进行绑定。</li>
<li>模式 <code>[]</code> 匹配上空list ~[]~，它也没有绑定。</li>
<li>模式 <code>[p1;...pn]</code> 能匹配上形如 <code>[v1;...vn]</code> 的值，并且有 <code>pi-&gt;vi</code> .</li>
</ul>
</div>

<div id="outline-container-org2621a25" class="outline-3">
<h3 id="org2621a25"><span class="section-number-3">11.1.</span> 模式匹配的求值规则（动态语义）</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">match</span> e <span style="color: #51afef;">with</span>
<span style="color: #f0e68c;">|</span> p1 <span style="color: #f0e68c;">-&gt;</span> e1
  <span style="color: #f0e68c;">...</span>
<span style="color: #f0e68c;">|</span> pn <span style="color: #f0e68c;">-&gt;</span> en
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<ul class="org-ul">
<li>将表达式 <code>e</code> 求值为 <code>v</code></li>
<li>将v分别和 <code>p1</code> &#x2026; <code>pn</code> 进行匹配。</li>
<li>若v无法和任何模式匹配上，则会抛出 <code>Match_failure</code> 异常。</li>
<li>否则，在第一个和v成功匹配的模式 <code>pi</code> 处停下，并用绑定 <code>pi -&gt; v</code> 将  <code>ei</code> 中的 <code>pi</code> 替换掉，得到新的表达式 <code>e'</code></li>
<li>对表达式 <code>e'</code> 求值为 <code>v'</code></li>
<li>整个match表达式的值为 <code>v'</code></li>
</ul>
</div>
</div>

<div id="outline-container-org58b7bdc" class="outline-3">
<h3 id="org58b7bdc"><span class="section-number-3">11.2.</span> 模式匹配静态语义</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-org85dd2dd" class="outline-4">
<h4 id="org85dd2dd"><span class="section-number-4">11.2.1.</span> 类型推断/检查</h4>
<div class="outline-text-4" id="text-11-2-1">
<p>
若 <code>e : ta</code> ，且  <code>pi:ta</code> ,  <code>ei:tb</code> , 则有：
 <code>match表达式 : tb</code> 
</p>
</div>
</div>

<div id="outline-container-orga796309" class="outline-4">
<h4 id="orga796309"><span class="section-number-4">11.2.2.</span> match的分支是否完整包含了所有情况</h4>
<div class="outline-text-4" id="text-11-2-2">
<pre class="example">
[partial-match]: this pattern-matching is not exhaustive.
</pre>
<p>
这种警告会在分支未完全覆盖可能出现的所有模式时发出：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"> <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">head</span><span style="color: #DFDFDF;"> lst</span> <span style="color: #f0e68c;">=</span>
   <span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
   <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>_ <span style="color: #f0e68c;">-&gt;</span> h
<span style="color: #62686E;">(* </span><span style="color: #62686E;">| [] -&gt; faliwith  "empty list"</span><span style="color: #62686E;">  *)</span>
 <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orga2a4bf8" class="outline-4">
<h4 id="orga2a4bf8"><span class="section-number-4">11.2.3.</span> match中是否包含无用分支</h4>
<div class="outline-text-4" id="text-11-2-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">head</span><span style="color: #DFDFDF;"> lst</span> <span style="color: #f0e68c;">=</span>
<span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> h
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[</span>x<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">-&gt;</span> x
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> 0
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
因为模式h::t已经包括了模式[x]的情况，因此这时会发出警告：
</p>
<pre class="example">
[redundant-case]: this match case is unused.
</pre>

<p>
但稍微调整一下分支的顺序，就能使这个例子的警告消失：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">head</span><span style="color: #DFDFDF;"> lst</span> <span style="color: #f0e68c;">=</span>
<span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[</span>x<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">-&gt;</span> x
  <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> h
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> 0
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org30f8666" class="outline-3">
<h3 id="org30f8666"><span class="section-number-3">11.3.</span> 一些关于list的模式</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #62686E;">(* </span><span style="color: #62686E;">&#33267;&#23569;&#21547;3&#20010;&#20803;&#32032;&#30340;list</span><span style="color: #62686E;"> *)</span>
_<span style="color: #f0e68c;">::</span>_<span style="color: #f0e68c;">::</span>_<span style="color: #f0e68c;">::</span>_
<span style="color: #62686E;">(* </span><span style="color: #62686E;">&#27491;&#22909;&#26377;&#20004;&#20010;&#20803;&#32032;&#30340;list</span><span style="color: #62686E;"> *)</span>
_<span style="color: #f0e68c;">::</span>_<span style="color: #f0e68c;">::[]</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1451e2" class="outline-3">
<h3 id="orgb1451e2"><span class="section-number-3">11.4.</span> 用于函数定义的简化模式匹配</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>最后一个参数是要进行匹配的，需要省略不写.</li>
<li>用 <code>function</code> 代替 <code>match xx with</code> .</li>
</ul>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">sum</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span>
  <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> h <span style="color: #f0e68c;">+</span> sum t
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">sum</span><span style="color: #DFDFDF;"> lst</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> lst <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> 0
  <span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #f0e68c;">-&gt;</span> h <span style="color: #f0e68c;">+</span> sum t
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2066c6a" class="outline-3">
<h3 id="org2066c6a"><span class="section-number-3">11.5.</span> 更多模式</h3>
<div class="outline-text-3" id="text-11-5">
</div>
<div id="outline-container-org609df90" class="outline-4">
<h4 id="org609df90"><span class="section-number-4">11.5.1.</span> 匹配上模式并满足when的条件</h4>
<div class="outline-text-4" id="text-11-5-1">
<p>
<code>p when e</code> : 当和模式p匹配且e的值为true
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">first_zero</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span> 
<span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">true</span> 
<span style="color: #f0e68c;">|</span> h<span style="color: #f0e68c;">::</span>t <span style="color: #51afef;">when</span> h <span style="color: #f0e68c;">=</span> 0 <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">true</span> 
<span style="color: #f0e68c;">|</span> _ <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span> 
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">number_or_letter</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span> 
  <span style="color: #f0e68c;">|</span><span style="color: #7bc275;">'A'</span> <span style="color: #f0e68c;">..</span> <span style="color: #7bc275;">'Z'</span> <span style="color: #f0e68c;">|</span> <span style="color: #7bc275;">'a'</span> <span style="color: #f0e68c;">..</span> <span style="color: #7bc275;">'z'</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"letter"</span> 
  <span style="color: #f0e68c;">|</span> <span style="color: #7bc275;">'0'</span> <span style="color: #f0e68c;">..</span> <span style="color: #7bc275;">'9'</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"number"</span>
  <span style="color: #f0e68c;">|</span> _ <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"??"</span> 
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<p>
这里有两个模式，一个是关于字符范围的，另一个是表示 OR 的。
</p>

<p>
<code>'A' .. 'Z'</code> 表示从A-Z的任意一个字符。
<code>|</code> 表示或
</p>
</div>
</div>
</div>

<div id="outline-container-org560486c" class="outline-3">
<h3 id="org560486c"><span class="section-number-3">11.6.</span> let in 中的模式匹配</h3>
<div class="outline-text-3" id="text-11-6">
<p>
在语法中
<code>let p=e in e1</code>
p可以是模式，而不仅仅是一个标识符：
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">a</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">b</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">(</span>1<span style="color: #f0e68c;">,</span> <span style="color: #7bc275;">'c'</span> <span style="color: #f0e68c;">)</span> <span style="color: #f5deb3; font-weight: bold;">in</span>
<span style="color: #FCCE7B;">Printf.</span>printf <span style="color: #7bc275;">"%i,%c %!"</span> a b
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
