ocaml-book/ocaml-book.org
** 元组的模式匹配
#+begin_src ocaml
  let thrid (_,_,x,_) = x ;;

  thrid 3,4,"hello", 5.0  ;; 
#+end_src




* 尾递归
在函数定义中，从递归调用返回后没有其他计算.

eg: sum函数

这不是尾递归，因为从sum返回后还需要一次加法运算
#+begin_src ocaml 
  let rec sum n =
    if n = 0 then 0
    else n + sum (n-1)  
  ;;
#+end_src

通过给递归函数增加一个参数 ~res~ 来保存中间结果使得它成为尾递归 ~tail recursion~

#+begin_src ocaml 
  let rec sum_tr res n  =
    if n = 0 then res 
    else sum_tr (res+n) (n-1) 
  ;;
  
  let sum n =
    sum_tr 0 n
  ;;
#+end_src

本质上，这个递归版本的sum函数只是将规模为N的问题转化成了 ~一个~ 规模为N-1的子问题，这种原问题和子问题之间的依赖关系只是一个链表结构，而不是一个树状结构。
只有树状的关系才无法成为尾递归，而在sum函数这个例子中完全不需要在 ~sum(n-1)~ 调用结束后再进行额外的计算来得到 ~sum n~ 的结果，而是将这部分计算放到 ~sum n-1~ 中完成



eg: 尾递归函数from产生从i ~ j 的列表 
#+begin_src ocaml

  let rec from i j lst  =
    if j < i then lst 
    else from i (j-1) (j :: lst)
  ;;

  let ( -- ) i j =
    from i j []
  ;;

  
  (* Usage: *)
  1 -- 10 ;;
#+end_src

#+begin_src
       - : int list = [1; 2; 3; 4; 5; 6; 7; 8; 9; 10]
#+end_src

OCaml中有类似的函数

#+begin_src
List.init  length  func  ==> [f 0;f 1;f 2;...;f (length-1) ] 
#+end_src

#+begin_src ocaml
  let plus_one x = x + 1 ;;

  List.init 10 plus_one ;;
#+end_src



* 变体 | Variants
变体就像是能在enum中使用class的一种东西。

Variant不能以大写字母开头！其下面的构造器名以大写字母开头！

#+begin_src ocaml
  type basic_color = Red | Green | Blue  ;;

  let which_color  = function
    | Red -> "red"
    | Green -> "green"
    | Blue -> "blue"
  ;;
#+end_src
这些以大写字母开头的单词是构造器/标签Tag
这些构造器Red能创建就是basic_color类型的值，并保留了这个值是Red的信息。
构造器能携带值，通过定义时加上 ~Tag of ValueType~

#+begin_src ocaml
  type  token = Ident of string  | Num of int  ;;
#+end_src

#+begin_src ocaml 
let tk = Ident "foo" ;;

val tk : token = Ident "foo"
#+end_src

#+begin_src ocaml
  Num 233 ;;
  
  - : token = Num 233
#+end_src

仍能从变量tk中获得它是一个Id的信息。
#+begin_src ocaml
  match tk with 
  |Ident name ->  name 
  |Num n -> string_of_int n 
  ;;

  - : string = "foo"
#+end_src


** 额外携带数据的Variant也被叫做代数数据类型
因为它包含了类型的sum product运算：
一个Varant值是多个构造器中的一种
每个构造器能携带record/tuple类型。

** 对Variant使用模式匹配的要点
尽量避免使用 ~_~ ,否则当增加Variant的选项后，很可能忘记修改match的代码来增加对应的新分支，
因为 ~_~ 通配符会匹配上这个新模式。


** Variant的递归定义

#+begin_src ocaml
type tnode   = EmptyNode | Node of  int   * tnode * tnode
;;
#+end_src

#+begin_src ocaml
   Node  (233 , (Node (123 ,EmptyNode,EmptyNode )) ,EmptyNode ) ;;
  
  - : tnode = Node (233, Node (123, EmptyNode, EmptyNode), EmptyNode)
#+end_src

