ocaml-book/ocaml-book.html

<div id="outline-container-org8e4aade" class="outline-3">
<h3 id="org8e4aade"><span class="section-number-3">11.7.</span> 元组的模式匹配</h3>
<div class="outline-text-3" id="text-11-7">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">thrid</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">_</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">_</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">x</span><span style="color: #f0e68c;">,</span><span style="color: #DFDFDF;">_</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">=</span> x <span style="color: #ff4500;">;;</span>

thrid 3<span style="color: #f0e68c;">,</span>4<span style="color: #f0e68c;">,</span><span style="color: #7bc275;">"hello"</span><span style="color: #f0e68c;">,</span> 5.0  <span style="color: #ff4500;">;;</span> 
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-orgef877bb" class="outline-2">
<h2 id="orgef877bb"><span class="section-number-2">12.</span> 尾递归</h2>
<div class="outline-text-2" id="text-12">
<p>
在函数定义中，从递归调用返回后没有其他计算.
</p>

<p>
eg: sum函数
</p>

<p>
这不是尾递归，因为从sum返回后还需要一次加法运算
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">sum</span><span style="color: #DFDFDF;"> n</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> n <span style="color: #f0e68c;">=</span> 0 <span style="color: #51afef;">then</span> 0
  <span style="color: #51afef;">else</span> n <span style="color: #f0e68c;">+</span> sum <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span>  
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
通过给递归函数增加一个参数 <code>res</code> 来保存中间结果使得它成为尾递归 <code>tail recursion</code>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">sum_tr</span><span style="color: #DFDFDF;"> res n</span>  <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> n <span style="color: #f0e68c;">=</span> 0 <span style="color: #51afef;">then</span> res 
  <span style="color: #51afef;">else</span> sum_tr <span style="color: #f0e68c;">(</span>res<span style="color: #f0e68c;">+</span>n<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> 
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">sum</span><span style="color: #DFDFDF;"> n</span> <span style="color: #f0e68c;">=</span>
  sum_tr 0 n
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
本质上，这个递归版本的sum函数只是将规模为N的问题转化成了 <code>一个</code> 规模为N-1的子问题，这种原问题和子问题之间的依赖关系只是一个链表结构，而不是一个树状结构。
只有树状的关系才无法成为尾递归，而在sum函数这个例子中完全不需要在 <code>sum(n-1)</code> 调用结束后再进行额外的计算来得到 <code>sum n</code> 的结果，而是将这部分计算放到 <code>sum n-1</code> 中完成
</p>



<p>
eg: 尾递归函数from产生从i ~ j 的列表 
</p>
<div class="org-src-container">
<pre class="src src-ocaml">
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">from</span><span style="color: #DFDFDF;"> i j lst</span>  <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> j <span style="color: #f0e68c;">&lt;</span> i <span style="color: #51afef;">then</span> lst 
  <span style="color: #51afef;">else</span> from i <span style="color: #f0e68c;">(</span>j<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">(</span>j <span style="color: #f0e68c;">::</span> lst<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">--</span> <span style="color: #f0e68c;">)</span> i j <span style="color: #f0e68c;">=</span>
  from i j <span style="color: #f0e68c;">[]</span>
<span style="color: #ff4500;">;;</span>


<span style="color: #62686E;">(* </span><span style="color: #62686E;">Usage:</span><span style="color: #62686E;"> *)</span>
1 <span style="color: #f0e68c;">--</span> 10 <span style="color: #ff4500;">;;</span>
</pre>
</div>

<pre class="example">
- : int list = [1; 2; 3; 4; 5; 6; 7; 8; 9; 10]
</pre>

<p>
OCaml中有类似的函数
</p>

<pre class="example">
List.init  length  func  ==&gt; [f 0;f 1;f 2;...;f (length-1) ] 
</pre>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">plus_one</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">=</span> x <span style="color: #f0e68c;">+</span> 1 <span style="color: #ff4500;">;;</span>

<span style="color: #FCCE7B;">List.</span>init 10 plus_one <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org7baf93e" class="outline-2">
<h2 id="org7baf93e"><span class="section-number-2">13.</span> 变体 | Variants</h2>
<div class="outline-text-2" id="text-13">
<p>
变体就像是能在enum中使用class的一种东西。
</p>

<p>
Variant不能以大写字母开头！其下面的构造器名以大写字母开头！
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">basic_color</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Red</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Green</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Blue</span>  <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">which_color</span>  <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Red</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"red"</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Green</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"green"</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Blue</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"blue"</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<p>
这些以大写字母开头的单词是构造器/标签Tag
这些构造器Red能创建就是basic<sub>color类型的值</sub>，并保留了这个值是Red的信息。
构造器能携带值，通过定义时加上 <code>Tag of ValueType</code>
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span>  <span style="color: #FCCE7B;">token</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Ident</span> <span style="color: #51afef;">of</span> string  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Num</span> <span style="color: #51afef;">of</span> int  <span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">tk</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Ident</span> <span style="color: #7bc275;">"foo"</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">val</span> <span style="color: #5cEfFF;">tk</span> <span style="color: #f0e68c;">:</span> token <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Ident</span> <span style="color: #7bc275;">"foo"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #bbc2cf; background-color: #242730;">Num</span> 233 <span style="color: #ff4500;">;;</span>

<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> token <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Num</span> 233
</pre>
</div>

<p>
仍能从变量tk中获得它是一个Id的信息。
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">match</span> tk <span style="color: #51afef;">with</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Ident</span> name <span style="color: #f0e68c;">-&gt;</span>  name 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Num</span> n <span style="color: #f0e68c;">-&gt;</span> string_of_int n 
<span style="color: #ff4500;">;;</span>

<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"foo"</span>
</pre>
</div>
</div>


<div id="outline-container-org2f0b976" class="outline-3">
<h3 id="org2f0b976"><span class="section-number-3">13.1.</span> 额外携带数据的Variant也被叫做代数数据类型</h3>
<div class="outline-text-3" id="text-13-1">
<p>
因为它包含了类型的sum product运算：
一个Varant值是多个构造器中的一种
每个构造器能携带record/tuple类型。
</p>
</div>
</div>

<div id="outline-container-orgbb4b115" class="outline-3">
<h3 id="orgbb4b115"><span class="section-number-3">13.2.</span> 对Variant使用模式匹配的要点</h3>
<div class="outline-text-3" id="text-13-2">
<p>
尽量避免使用 <code>_</code> ,否则当增加Variant的选项后，很可能忘记修改match的代码来增加对应的新分支，
因为 <code>_</code> 通配符会匹配上这个新模式。
</p>
</div>
</div>


<div id="outline-container-org2a46390" class="outline-3">
<h3 id="org2a46390"><span class="section-number-3">13.3.</span> Variant的递归定义</h3>
<div class="outline-text-3" id="text-13-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">tnode</span>   <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #51afef;">of</span>  int   <span style="color: #f0e68c;">*</span> tnode <span style="color: #f0e68c;">*</span> tnode
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"> <span style="color: #bbc2cf; background-color: #242730;">Node</span>  <span style="color: #f0e68c;">(</span>233 <span style="color: #f0e68c;">,</span> <span style="color: #f0e68c;">(</span><span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">(</span>123 <span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span><span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span> <span style="color: #f0e68c;">))</span> <span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span> <span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> tnode <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">(</span>233<span style="color: #f0e68c;">,</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">(</span>123<span style="color: #f0e68c;">,</span> <span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span><span style="color: #f0e68c;">,</span> <span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span><span style="color: #f0e68c;">),</span> <span style="color: #bbc2cf; background-color: #242730;">EmptyNode</span><span style="color: #f0e68c;">)</span>
</pre>
</div>
</div>
</div>
