ocaml-book/ocaml-book.org
** ~and~ 关键字使类型定义可以是互相递归的

#+begin_src ocaml 
  type node  = { value : int ; nextnode : int mylist}
  and  mylist = Nil | Node of int node
  ;;
  (* 同时定义了一个 record 和一个 variant*)
#+end_src

#+begin_src ocaml
 Node{ value = 123 ; nextnode = Node{value = 2333 ; nextnode = Nil } } 
;;
#+end_src

#+begin_src ocaml
  type tnode = {value : int ; left : mytree ; right: mytree}
  and mytree = TNil | TNode of tnode
  ;;
#+end_src

** Variants的参数多态 
带范型的Variants 
#+begin_src ocaml 
  type 'a node  = { value : 'a ; nextnode : 'a mylist}
  and 'a mylist = Nil | Node of 'a node
  ;;
#+end_src

当然，一个更清晰的版本是：
#+begin_src ocaml
  type 'a mylist = Nil | Node of 'a * 'a mylist  ;;
#+end_src

#+begin_src ocaml
Node ( 233 , Node (123, Nil)) ;;
#+end_src

*多个类型参数:*
#+begin_src ocaml
  type ('a , 'b) mypair = {first :'a ;second :'b}
  ;;
#+end_src

list/options 就是参数化Variant :
#+begin_src ocaml
  let  'a list = [] | ( :: ) of 'a * 'a list
  ;;
#+end_src
#+begin_src ocaml
  type 'a options = None | Some of 'a
  ;;
#+end_src


** 多态Variant/匿名Variant

当某些Variant只需要使用一次（eg 作为返回值），这时候给它一个全局定义是没必要的。
这时需要匿名Variant：
在构造器前面加上 =`= 

#+begin_src ocaml
  let mydiv a b =
    if b = 0 then `Inf
    else `Num (a/b)
  ;;
#+end_src

#+begin_src ocaml
val mydiv : int -> int -> [> `Inf | `Num of int ] = <fun>
#+end_src

#+begin_src ocaml
  utop[41]> mydiv 2 3 ;;
  - : [> `Inf | `Num of int ] = `Num 0
#+end_src

#+begin_src ocaml
  utop[42]> mydiv 4 0 ;;
  - : [> `Inf | `Num of int ] = `Inf
#+end_src


* 和match天生一对的Options= Some/None

在不用空指针的情况下表达“返回结果可能为空。

#+begin_src ocaml
  let getstr  s =
    if s = "" then None
    else Some s
  ;;
#+end_src

#+begin_src ocaml
    getstr "" ;;
    - : string option = None

    getstr "hello" ;;
    - : string option = Some "hello"
#+end_src
对需要处理值是Options的代码，需要用 ~match~ 进行匹配。
#+begin_src ocaml
  let dealwiths s = match s with 
    |None -> "there is nothing"
    |Some x -> "this is " ^ x 
  ;;
#+end_src

#+begin_src ocaml
  dealwiths (Some "a cat" ) ;;
  - : string = "this is a cat"

  dealwiths (getstr "") ;;
  - : string = "there is nothing"
#+end_src

None 的类型是 ~'a option~ , Some expr的类型是 ~t option~ (expr:t)
用None表示返回一个空 + 模式匹配强制要求处理Options所有可能的模式 = 强制要求检查返回值可能为空的场景。




* 列表推导 | List Comprehensions
一种产生list的语法糖。


