ocaml-book/ocaml-book.html

<div id="outline-container-org257ec72" class="outline-3">
<h3 id="org257ec72"><span class="section-number-3">13.4.</span> <code>and</code> 关键字使类型定义可以是互相递归的</h3>
<div class="outline-text-3" id="text-13-4">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">node</span>  <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span> value <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">;</span> nextnode <span style="color: #f0e68c;">:</span> int mylist<span style="color: #f0e68c;">}</span>
<span style="color: #f5deb3; font-weight: bold;">and</span>  <span style="color: #DFDFDF;">mylist</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nil</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #51afef;">of</span> int node
<span style="color: #ff4500;">;;</span>
<span style="color: #62686E;">(* </span><span style="color: #62686E;">&#21516;&#26102;&#23450;&#20041;&#20102;&#19968;&#20010; record &#21644;&#19968;&#20010; variant</span><span style="color: #62686E;">*)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"> <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span> value <span style="color: #f0e68c;">=</span> 123 <span style="color: #f0e68c;">;</span> nextnode <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span>value <span style="color: #f0e68c;">=</span> 2333 <span style="color: #f0e68c;">;</span> nextnode <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nil</span> <span style="color: #f0e68c;">}</span> <span style="color: #f0e68c;">}</span> 
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">tnode</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span>value <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">;</span> left <span style="color: #f0e68c;">:</span> mytree <span style="color: #f0e68c;">;</span> right<span style="color: #f0e68c;">:</span> mytree<span style="color: #f0e68c;">}</span>
<span style="color: #f5deb3; font-weight: bold;">and</span> <span style="color: #DFDFDF;">mytree</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">TNil</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">TNode</span> <span style="color: #51afef;">of</span> tnode
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org15d9308" class="outline-3">
<h3 id="org15d9308"><span class="section-number-3">13.5.</span> Variants的参数多态</h3>
<div class="outline-text-3" id="text-13-5">
<p>
带范型的Variants 
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">'a node</span>  <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span> value <span style="color: #f0e68c;">:</span> 'a <span style="color: #f0e68c;">;</span> nextnode <span style="color: #f0e68c;">:</span> 'a mylist<span style="color: #f0e68c;">}</span>
<span style="color: #f5deb3; font-weight: bold;">and</span> 'a mylist <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nil</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #51afef;">of</span> 'a node
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
当然，一个更清晰的版本是：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">'a mylist</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nil</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #51afef;">of</span> 'a <span style="color: #f0e68c;">*</span> 'a mylist  <span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">(</span> 233 <span style="color: #f0e68c;">,</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">(</span>123<span style="color: #f0e68c;">,</span> <span style="color: #bbc2cf; background-color: #242730;">Nil</span><span style="color: #f0e68c;">))</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
<b>多个类型参数:</b>
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #f0e68c;">(</span><span style="color: #FCCE7B;">'a </span><span style="color: #f0e68c;">,</span><span style="color: #FCCE7B;"> 'b</span><span style="color: #f0e68c;">)</span><span style="color: #FCCE7B;"> mypair</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span>first <span style="color: #f0e68c;">:</span>'a <span style="color: #f0e68c;">;</span>second <span style="color: #f0e68c;">:</span>'b<span style="color: #f0e68c;">}</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
list/options 就是参数化Variant :
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span>  'a list <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">[]</span> <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">::</span> <span style="color: #f0e68c;">)</span> <span style="color: #51afef;">of</span> 'a <span style="color: #f0e68c;">*</span> 'a list
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">'a options</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">None</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Some</span> <span style="color: #51afef;">of</span> 'a
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org6239765" class="outline-3">
<h3 id="org6239765"><span class="section-number-3">13.6.</span> 多态Variant/匿名Variant</h3>
<div class="outline-text-3" id="text-13-6">
<p>
当某些Variant只需要使用一次（eg 作为返回值），这时候给它一个全局定义是没必要的。
这时需要匿名Variant：
在构造器前面加上 <code>`</code> 
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">mydiv</span><span style="color: #DFDFDF;"> a b</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> b <span style="color: #f0e68c;">=</span> 0 <span style="color: #51afef;">then</span> <span style="color: #bbc2cf; background-color: #242730;">`Inf</span>
  <span style="color: #51afef;">else</span> <span style="color: #bbc2cf; background-color: #242730;">`Num</span> <span style="color: #f0e68c;">(</span>a<span style="color: #f0e68c;">/</span>b<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">val</span> <span style="color: #5cEfFF;">mydiv</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">-&gt;</span> int <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">[&gt;</span> <span style="color: #bbc2cf; background-color: #242730;">`Inf</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">`Num</span> <span style="color: #51afef;">of</span> int <span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">utop<span style="color: #f0e68c;">[</span>41<span style="color: #f0e68c;">]&gt;</span> mydiv 2 3 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> <span style="color: #f0e68c;">[&gt;</span> <span style="color: #bbc2cf; background-color: #242730;">`Inf</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">`Num</span> <span style="color: #51afef;">of</span> int <span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">`Num</span> 0
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">utop<span style="color: #f0e68c;">[</span>42<span style="color: #f0e68c;">]&gt;</span> mydiv 4 0 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> <span style="color: #f0e68c;">[&gt;</span> <span style="color: #bbc2cf; background-color: #242730;">`Inf</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">`Num</span> <span style="color: #51afef;">of</span> int <span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">`Inf</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcf0d406" class="outline-2">
<h2 id="orgcf0d406"><span class="section-number-2">14.</span> 和match天生一对的Options= Some/None</h2>
<div class="outline-text-2" id="text-14">
<p>
在不用空指针的情况下表达“返回结果可能为空。
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">getstr</span><span style="color: #DFDFDF;">  s</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> s <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">""</span> <span style="color: #51afef;">then</span> <span style="color: #bbc2cf; background-color: #242730;">None</span>
  <span style="color: #51afef;">else</span> <span style="color: #bbc2cf; background-color: #242730;">Some</span> s
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">getstr <span style="color: #7bc275;">""</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string option <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">None</span>

getstr <span style="color: #7bc275;">"hello"</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string option <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Some</span> <span style="color: #7bc275;">"hello"</span>
</pre>
</div>
<p>
对需要处理值是Options的代码，需要用 <code>match</code> 进行匹配。
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">dealwiths</span><span style="color: #DFDFDF;"> s</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">match</span> s <span style="color: #51afef;">with</span> 
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">None</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"there is nothing"</span>
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Some</span> x <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"this is "</span> <span style="color: #f0e68c;">^</span> x 
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">dealwiths <span style="color: #f0e68c;">(</span><span style="color: #bbc2cf; background-color: #242730;">Some</span> <span style="color: #7bc275;">"a cat"</span> <span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"this is a cat"</span>

dealwiths <span style="color: #f0e68c;">(</span>getstr <span style="color: #7bc275;">""</span><span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"there is nothing"</span>
</pre>
</div>

<p>
None 的类型是 <code>'a option</code> , Some expr的类型是 <code>t option</code> (expr:t)
用None表示返回一个空 + 模式匹配强制要求处理Options所有可能的模式 = 强制要求检查返回值可能为空的场景。
</p>
</div>
</div>




<div id="outline-container-orge27b2ba" class="outline-2">
<h2 id="orge27b2ba"><span class="section-number-2">15.</span> 列表推导 | List Comprehensions</h2>
<div class="outline-text-2" id="text-15">
<p>
一种产生list的语法糖。
</p>
</div>
</div>
