ocaml-book/ocaml-book.org
* OUnit2

首先创建dune项目
#+begin_src bash
dune init project yourproject
#+end_src

在dune中链接ounit2:

#+begin_src dune
  (executable
    (name test_xx)
    (libraries ounit2))
#+end_src


创建测试文件  ~test_xx.ml~ 
引入ounit2和被测试的模块
#+begin_src ocaml
  open Xx
  open OUnit2

#+end_src


为某个函数/功能创建测试套件：
#+begin_src ocaml
  "测试套件名" >::: [  (* 测试项list *) ] 
#+end_src

编写测试用例：
#+begin_src ocaml
  "测试项目名" >:: (fun _ -> assert_xxx arg1 arg2 .. ) ;
#+end_src

运行一个测试套件：

#+begin_src ocaml
let _ = run_test_tt_main 测试套件 
#+end_src



完整例子：

#+begin_src ocaml
open OUnit2
open Sum

let tests = "test suite for sum" >::: [
    "empty" >:: (fun _ -> assert_equal 0 (sum []) ) ;
    "singleton" >:: (fun _ -> assert_equal 1 (sum [1]) ) ;
    "two elements" >:: (fun _ -> assert_equal 3 (sum [1;2]));
  ]

let _ = run_test_tt_main tests 
#+end_src


** 打印测试用例出错时的值

要给 ~assert_xxx~ 的 ~printer~ 参数传入一个输出字符串表达的函数，eg: ~string_of_int~ 
#+begin_src ocaml

  
  let mytsts = "test suite for some module" >::: [
      "case1" >:: (fun _ -> assert_equal 0 (sum []) ~printer:string_of_int ) ;
      ]
#+end_src


会输出：
#+begin_src 
expected: 0 but got: 1
#+end_src

从这个打印结果能看出，assert的首个参数应该是期望的值。





** 测试是否发出了异常

#+begin_src ocaml
"test case" >:: (fun _ -> assert_raise (异常对象) (fun () -> 能发出异常的表达式 ) ) 
#+end_src


#+begin_src ocaml
  open OUnit2
  open Stdlib   
   
  let raise_expection () =
    raise (Failure "mytest")
  ;;

  let mytests = "test suite" >::: [
      "test-raise-exceptions" >:: (fun _ -> assert_raises
				      (Failure "mytest") (fun () -> raise_expection ( ) ))
    ]

  let _ = run_test_tt_main mytests ;; 
#+end_src



* Records & Tuples

将几个数据放到一起的方式有两种：
Records就像C中的结构体，主要特点是能按名字访问字段。
Tuples不会给字段命名，而是通过位置来访问字段。
二者都是定长的类型。

** Record定义 

#+begin_src ocaml
  type ptype = TNormal | TFire | TWater ;;

  type mon = {name : string ; hp : int ; ptype : ptype } ;;

  let c = {name = "bird" ;hp = 40 ; ptype = TNormal } ;;
  (* 字段的顺序可以和定义不一致 *)
  
#+end_src

** 访问Record的字段

*** 通过 ~R.field~

field只能是定义中提到的标识符，而不是表达式。

若想要通过某些计算来动态获得字段名，应该使用 ~map~ 类型。

#+begin_src ocaml
  c.name ;; 
#+end_src

*** 通过模式匹配
#+begin_src ocaml
  match c with
    | { name=n; hp=h; ptype=t } -> n
  ;;
#+end_src


** 从旧record中创建新record

#+begin_src ocaml
let new_c = { c with name = "world" ; hp = 123 } ;;
#+end_src
创建record拷贝，只是某些字段的值不同。








