ocaml-book/ocaml-book.html


<div id="outline-container-orgd854086" class="outline-2">
<h2 id="orgd854086"><span class="section-number-2">16.</span> OUnit2</h2>
<div class="outline-text-2" id="text-16">
<p>
首先创建dune项目
</p>
<div class="org-src-container">
<pre class="src src-bash">dune init project yourproject
</pre>
</div>

<p>
在dune中链接ounit2:
</p>

<div class="org-src-container">
<pre class="src src-dune">(<span style="color: #51afef;">executable</span>
  (<span style="color: #5cEfFF;">name</span> test_xx)
  (<span style="color: #5cEfFF;">libraries</span> ounit2))
</pre>
</div>


<p>
创建测试文件  <code>test_xx.ml</code> 
引入ounit2和被测试的模块
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">Xx</span>
<span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>

</pre>
</div>


<p>
为某个函数/功能创建测试套件：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"&#27979;&#35797;&#22871;&#20214;&#21517;"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>  <span style="color: #62686E;">(* </span><span style="color: #62686E;">&#27979;&#35797;&#39033;list</span><span style="color: #62686E;"> *)</span> <span style="color: #f0e68c;">]</span> 
</pre>
</div>

<p>
编写测试用例：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"&#27979;&#35797;&#39033;&#30446;&#21517;"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_xxx arg1 arg2 <span style="color: #f0e68c;">..</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
</pre>
</div>

<p>
运行一个测试套件：
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main &#27979;&#35797;&#22871;&#20214; 
</pre>
</div>



<p>
完整例子：
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>
<span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">Sum</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">tests</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"test suite for sum"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>
    <span style="color: #7bc275;">"empty"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 0 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[])</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
    <span style="color: #7bc275;">"singleton"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 1 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">])</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
    <span style="color: #7bc275;">"two elements"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 3 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[</span>1<span style="color: #f0e68c;">;</span>2<span style="color: #f0e68c;">]));</span>
  <span style="color: #f0e68c;">]</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main tests 
</pre>
</div>
</div>


<div id="outline-container-org20f7ae8" class="outline-3">
<h3 id="org20f7ae8"><span class="section-number-3">16.1.</span> 打印测试用例出错时的值</h3>
<div class="outline-text-3" id="text-16-1">
<p>
要给 <code>assert_xxx</code> 的 <code>printer</code> 参数传入一个输出字符串表达的函数，eg: <code>string_of_int</code> 
</p>
<div class="org-src-container">
<pre class="src src-ocaml">

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">mytsts</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"test suite for some module"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>
    <span style="color: #7bc275;">"case1"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_equal 0 <span style="color: #f0e68c;">(</span>sum <span style="color: #f0e68c;">[])</span> <span style="color: #a991f1;">~printer</span><span style="color: #f0e68c;">:</span>string_of_int <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">;</span>
    <span style="color: #f0e68c;">]</span>
</pre>
</div>


<p>
会输出：
</p>
<pre class="example">
expected: 0 but got: 1
</pre>

<p>
从这个打印结果能看出，assert的首个参数应该是期望的值。
</p>
</div>
</div>





<div id="outline-container-orge93ef79" class="outline-3">
<h3 id="orge93ef79"><span class="section-number-3">16.2.</span> 测试是否发出了异常</h3>
<div class="outline-text-3" id="text-16-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7bc275;">"test case"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_raise <span style="color: #f0e68c;">(</span>&#24322;&#24120;&#23545;&#35937;<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #f0e68c;">()</span> <span style="color: #f0e68c;">-&gt;</span> &#33021;&#21457;&#20986;&#24322;&#24120;&#30340;&#34920;&#36798;&#24335; <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">)</span> 
</pre>
</div>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">OUnit2</span>
<span style="color: #f5deb3; font-weight: bold;">open </span><span style="color: #FCCE7B;">Stdlib</span>   

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">raise_expection</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">()</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span><span style="color: #C57BDB;">Failure</span> <span style="color: #7bc275;">"mytest"</span><span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">mytests</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"test suite"</span> <span style="color: #f0e68c;">&gt;:::</span> <span style="color: #f0e68c;">[</span>
    <span style="color: #7bc275;">"test-raise-exceptions"</span> <span style="color: #f0e68c;">&gt;::</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">-&gt;</span> assert_raises
                                    <span style="color: #f0e68c;">(</span><span style="color: #C57BDB;">Failure</span> <span style="color: #7bc275;">"mytest"</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">(</span><span style="color: #51afef;">fun</span> <span style="color: #f0e68c;">()</span> <span style="color: #f0e68c;">-&gt;</span> raise_expection <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">))</span>
  <span style="color: #f0e68c;">]</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">_</span> <span style="color: #f0e68c;">=</span> run_test_tt_main mytests <span style="color: #ff4500;">;;</span> 
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orga97f8d5" class="outline-2">
<h2 id="orga97f8d5"><span class="section-number-2">17.</span> Records &amp; Tuples</h2>
<div class="outline-text-2" id="text-17">
<p>
将几个数据放到一起的方式有两种：
Records就像C中的结构体，主要特点是能按名字访问字段。
Tuples不会给字段命名，而是通过位置来访问字段。
二者都是定长的类型。
</p>
</div>

<div id="outline-container-org5b788b1" class="outline-3">
<h3 id="org5b788b1"><span class="section-number-3">17.1.</span> Record定义</h3>
<div class="outline-text-3" id="text-17-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">ptype</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">TNormal</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">TFire</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">TWater</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">mon</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span>name <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">;</span> hp <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">;</span> ptype <span style="color: #f0e68c;">:</span> ptype <span style="color: #f0e68c;">}</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">c</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span>name <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"bird"</span> <span style="color: #f0e68c;">;</span>hp <span style="color: #f0e68c;">=</span> 40 <span style="color: #f0e68c;">;</span> ptype <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">TNormal</span> <span style="color: #f0e68c;">}</span> <span style="color: #ff4500;">;;</span>
<span style="color: #62686E;">(* </span><span style="color: #62686E;">&#23383;&#27573;&#30340;&#39034;&#24207;&#21487;&#20197;&#21644;&#23450;&#20041;&#19981;&#19968;&#33268;</span><span style="color: #62686E;"> *)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org0b4397f" class="outline-3">
<h3 id="org0b4397f"><span class="section-number-3">17.2.</span> 访问Record的字段</h3>
<div class="outline-text-3" id="text-17-2">
</div>
<div id="outline-container-org3344075" class="outline-4">
<h4 id="org3344075"><span class="section-number-4">17.2.1.</span> 通过 <code>R.field</code></h4>
<div class="outline-text-4" id="text-17-2-1">
<p>
field只能是定义中提到的标识符，而不是表达式。
</p>

<p>
若想要通过某些计算来动态获得字段名，应该使用 <code>map</code> 类型。
</p>

<div class="org-src-container">
<pre class="src src-ocaml">c.name <span style="color: #ff4500;">;;</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d11841" class="outline-4">
<h4 id="org6d11841"><span class="section-number-4">17.2.2.</span> 通过模式匹配</h4>
<div class="outline-text-4" id="text-17-2-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">match</span> c <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">{</span> name<span style="color: #f0e68c;">=</span>n<span style="color: #f0e68c;">;</span> hp<span style="color: #f0e68c;">=</span>h<span style="color: #f0e68c;">;</span> ptype<span style="color: #f0e68c;">=</span>t <span style="color: #f0e68c;">}</span> <span style="color: #f0e68c;">-&gt;</span> n
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org7837bdc" class="outline-3">
<h3 id="org7837bdc"><span class="section-number-3">17.3.</span> 从旧record中创建新record</h3>
<div class="outline-text-3" id="text-17-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">new_c</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">{</span> c <span style="color: #51afef;">with</span> name <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"world"</span> <span style="color: #f0e68c;">;</span> hp <span style="color: #f0e68c;">=</span> 123 <span style="color: #f0e68c;">}</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
<p>
创建record拷贝，只是某些字段的值不同。
</p>
</div>
</div>
