ocaml-book/ocaml-book.org
** Tuple的定义
#+begin_src ocaml
  type subject = string * int ;; 
#+end_src

用小括号和 ~,~ 来创建一个tuple变量。
#+begin_src ocaml
let t = (23,3.0,"hello") ;; 
#+end_src

~int * float * string~ 是t的类型：
#+begin_src ocaml
val t : int * float * string = (23, 3., "hello)"
#+end_src


 

* 类型别名
#+begin_src ocaml
  type point = float * float ;;
  type intlist = int list ;;
  
#+end_src






* 异常
OCaml中的异常是一个 *可拓展* 的Variant.

有了异常的概念后，我们能完整地描述OCaml表达式的 *动态语义* ：
+ 被计算为一个值 evaluates to a value
+ 发出异常 raises an expection
+ 无限循环 an infinite loop

（因此在match的分支中要充分考虑到前两类） 

** 定义一个新的异常

不携带数据：
#+begin_src ocaml
  exception SomethingWrong  ;; 
#+end_src

携带数据的构造器
#+begin_src ocaml
  exception MyException of int * string ;;
#+end_src

#+begin_src ocaml
  MyException (22, "err" ) ;; 

  - : exn = MyException(22, "err")
#+end_src



** 抛出异常

raise是引发异常的通用手段。
failwith只能引发Failure这个类型的异常。

*** raise


#+begin_src ocaml
raise ( MyException (233,"error") ) ;;
#+end_src

注意raise的返回类型： ='a=
这是一个范型，因为raise不会求值为某个值，而是抛出异常，因此它的作用是应付类型检查。
在 if / match等结构中，都要求分支的类型相同。raise的返回类型为 ~'a~ 使得正常返回值的分支和发出异常的分支能够相容。


#+begin_src ocaml
   raise ;;
  
  - : exn -> 'a = <fun>
#+end_src


*** failwith
#+begin_src ocaml
failwith "xxx" ;;
#+end_src
等价于

#+begin_src ocaml
raise (Failure "xxx") ;;
#+end_src


** 捕获并处理异常

用try with捕获异常后的行为应该是提供一个和表达式类型相同的值 
#+begin_src ocaml
  try 表达式 : T with
  | Exn1 -> e1 : T
  | Exn2 -> e2 : T
  ;;
#+end_src


#+begin_src ocaml
  let raise_some_exn a b =
    match a,b with
    | 0,_ -> raise SomethingWrong 
    | _,0 -> raise ( MyException ( (-1) , "div by 0" ) )
    | _,_ -> a/b
  ;;
#+end_src

 ~try with~ 的目的是让异常消失，并在异常发生时赋予表达式一个值 （类型要和表达式的相同）

match则更加通用，分支的类型不必和被匹配的表达式的类型一致。

#+begin_src ocaml
  let catch_exception a b = 
    try
      raise_some_exn a b
    with
    | SomethingWrong -> 0 
    | MyException (i,s) -> 4611686018427387903
  ;;
#+end_src

用match也能实现异常的捕获+处理，但更加麻烦：必须要写 =exception= ！

#+begin_src ocaml
  match raise_some_exn 1 0 with 
    | exception (MyException ( i,s)) -> (string_of_int i ) ^ s 
    | exception SomethingWrong -> "something wrong"
    | x  -> string_of_int x 
  ;;


  match
    try raise_some_exn 1 0 with (*根据发生的异常种类来为表达式赋以特殊值 *)
    | SomethingWrong -> 0 
    | MyException (i,s) ->  4611686018427387903 
  with (*根据返回值的形式来决定后续动作 *)
  | 0 -> "something wrong"
  |  4611686018427387903   -> "div 0"
  | x -> "result = " ^ string_of_int x
  ;;
#+end_src



* 定义二叉树类型 Binary Tree

Leaf表示空节点，即不存放值，仅作为占位使用。

Node表示非空节点，是否为叶节点要看它是否有子节点。 

叶节点： =Node(value,Leaf,Leaf)=
非叶节点：左右子节点至少有一个不是 =Leaf= 

