ocaml-book/ocaml-book.html








<div id="outline-container-org9feebd5" class="outline-3">
<h3 id="org9feebd5"><span class="section-number-3">17.4.</span> Tuple的定义</h3>
<div class="outline-text-3" id="text-17-4">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">subject</span> <span style="color: #f0e68c;">=</span> string <span style="color: #f0e68c;">*</span> int <span style="color: #ff4500;">;;</span> 
</pre>
</div>

<p>
用小括号和 <code>,</code> 来创建一个tuple变量。
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">t</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">(</span>23<span style="color: #f0e68c;">,</span>3.0<span style="color: #f0e68c;">,</span><span style="color: #7bc275;">"hello"</span><span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span> 
</pre>
</div>

<p>
<code>int * float * string</code> 是t的类型：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">val</span> <span style="color: #5cEfFF;">t</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">*</span> float <span style="color: #f0e68c;">*</span> string <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">(</span>23<span style="color: #f0e68c;">,</span> 3.<span style="color: #f0e68c;">,</span> <span style="color: #7bc275;">"hello)"</span>
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-orgd944cc7" class="outline-2">
<h2 id="orgd944cc7"><span class="section-number-2">18.</span> 类型别名</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">point</span> <span style="color: #f0e68c;">=</span> float <span style="color: #f0e68c;">*</span> float <span style="color: #ff4500;">;;</span>
<span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">intlist</span> <span style="color: #f0e68c;">=</span> int list <span style="color: #ff4500;">;;</span>

</pre>
</div>
</div>
</div>






<div id="outline-container-org3fb8fed" class="outline-2">
<h2 id="org3fb8fed"><span class="section-number-2">19.</span> 异常</h2>
<div class="outline-text-2" id="text-19">
<p>
OCaml中的异常是一个 <b>可拓展</b> 的Variant.
</p>

<p>
有了异常的概念后，我们能完整地描述OCaml表达式的 <b>动态语义</b> ：
</p>
<ul class="org-ul">
<li>被计算为一个值 evaluates to a value</li>
<li>发出异常 raises an expection</li>
<li>无限循环 an infinite loop</li>
</ul>

<p>
（因此在match的分支中要充分考虑到前两类） 
</p>
</div>

<div id="outline-container-org931229d" class="outline-3">
<h3 id="org931229d"><span class="section-number-3">19.1.</span> 定义一个新的异常</h3>
<div class="outline-text-3" id="text-19-1">
<p>
不携带数据：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">exception</span> <span style="color: #bbc2cf; background-color: #242730;">SomethingWrong</span>  <span style="color: #ff4500;">;;</span> 
</pre>
</div>

<p>
携带数据的构造器
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">exception</span> <span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #51afef;">of</span> int <span style="color: #f0e68c;">*</span> string <span style="color: #ff4500;">;;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #f0e68c;">(</span>22<span style="color: #f0e68c;">,</span> <span style="color: #7bc275;">"err"</span> <span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span> 

<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> exn <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">MyException</span><span style="color: #f0e68c;">(</span>22<span style="color: #f0e68c;">,</span> <span style="color: #7bc275;">"err"</span><span style="color: #f0e68c;">)</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-orgccd12bd" class="outline-3">
<h3 id="orgccd12bd"><span class="section-number-3">19.2.</span> 抛出异常</h3>
<div class="outline-text-3" id="text-19-2">
<p>
raise是引发异常的通用手段。
failwith只能引发Failure这个类型的异常。
</p>
</div>

<div id="outline-container-orgba2194c" class="outline-4">
<h4 id="orgba2194c"><span class="section-number-4">19.2.1.</span> raise</h4>
<div class="outline-text-4" id="text-19-2-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span> <span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #f0e68c;">(</span>233<span style="color: #f0e68c;">,</span><span style="color: #7bc275;">"error"</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
注意raise的返回类型： <code>'a</code>
这是一个范型，因为raise不会求值为某个值，而是抛出异常，因此它的作用是应付类型检查。
在 if / match等结构中，都要求分支的类型相同。raise的返回类型为 <code>'a</code> 使得正常返回值的分支和发出异常的分支能够相容。
</p>


<div class="org-src-container">
<pre class="src src-ocaml"> <span style="color: #C57BDB;">raise</span> <span style="color: #ff4500;">;;</span>

<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> exn <span style="color: #f0e68c;">-&gt;</span> 'a <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">&lt;</span><span style="color: #51afef;">fun</span><span style="color: #f0e68c;">&gt;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org0ac3202" class="outline-4">
<h4 id="org0ac3202"><span class="section-number-4">19.2.2.</span> failwith</h4>
<div class="outline-text-4" id="text-19-2-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #C57BDB;">failwith</span> <span style="color: #7bc275;">"xxx"</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
<p>
等价于
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span><span style="color: #C57BDB;">Failure</span> <span style="color: #7bc275;">"xxx"</span><span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga4af236" class="outline-3">
<h3 id="orga4af236"><span class="section-number-3">19.3.</span> 捕获并处理异常</h3>
<div class="outline-text-3" id="text-19-3">
<p>
用try with捕获异常后的行为应该是提供一个和表达式类型相同的值 
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">try</span> &#34920;&#36798;&#24335; <span style="color: #f0e68c;">:</span> <span style="color: #bbc2cf; background-color: #242730;">T</span> <span style="color: #51afef;">with</span>
<span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Exn1</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">e1</span> <span style="color: #f0e68c;">:</span> <span style="color: #bbc2cf; background-color: #242730;">T</span>
<span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Exn2</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">e2</span> <span style="color: #f0e68c;">:</span> <span style="color: #bbc2cf; background-color: #242730;">T</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">raise_some_exn</span><span style="color: #DFDFDF;"> a b</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">match</span> a<span style="color: #f0e68c;">,</span>b <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> 0<span style="color: #f0e68c;">,</span>_ <span style="color: #f0e68c;">-&gt;</span> <span style="color: #C57BDB;">raise</span> <span style="color: #bbc2cf; background-color: #242730;">SomethingWrong</span> 
  <span style="color: #f0e68c;">|</span> _<span style="color: #f0e68c;">,</span>0 <span style="color: #f0e68c;">-&gt;</span> <span style="color: #C57BDB;">raise</span> <span style="color: #f0e68c;">(</span> <span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">(-</span>1<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">,</span> <span style="color: #7bc275;">"div by 0"</span> <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">)</span>
  <span style="color: #f0e68c;">|</span> _<span style="color: #f0e68c;">,</span>_ <span style="color: #f0e68c;">-&gt;</span> a<span style="color: #f0e68c;">/</span>b
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
<code>try with</code> 的目的是让异常消失，并在异常发生时赋予表达式一个值 （类型要和表达式的相同）
</p>

<p>
match则更加通用，分支的类型不必和被匹配的表达式的类型一致。
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">catch_exception</span><span style="color: #DFDFDF;"> a b</span> <span style="color: #f0e68c;">=</span> 
  <span style="color: #51afef;">try</span>
    raise_some_exn a b
  <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">SomethingWrong</span> <span style="color: #f0e68c;">-&gt;</span> 0 
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #f0e68c;">(</span>i<span style="color: #f0e68c;">,</span>s<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span> 4611686018427387903
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
用match也能实现异常的捕获+处理，但更加麻烦：必须要写 <code>exception</code> ！
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #51afef;">match</span> raise_some_exn 1 0 <span style="color: #51afef;">with</span> 
  <span style="color: #f0e68c;">|</span> <span style="color: #51afef;">exception</span> <span style="color: #f0e68c;">(</span><span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #f0e68c;">(</span> i<span style="color: #f0e68c;">,</span>s<span style="color: #f0e68c;">))</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">(</span>string_of_int i <span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">^</span> s 
  <span style="color: #f0e68c;">|</span> <span style="color: #51afef;">exception</span> <span style="color: #bbc2cf; background-color: #242730;">SomethingWrong</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"something wrong"</span>
  <span style="color: #f0e68c;">|</span> x  <span style="color: #f0e68c;">-&gt;</span> string_of_int x 
<span style="color: #ff4500;">;;</span>


<span style="color: #51afef;">match</span>
  <span style="color: #51afef;">try</span> raise_some_exn 1 0 <span style="color: #51afef;">with</span> <span style="color: #62686E;">(*</span><span style="color: #62686E;">&#26681;&#25454;&#21457;&#29983;&#30340;&#24322;&#24120;&#31181;&#31867;&#26469;&#20026;&#34920;&#36798;&#24335;&#36171;&#20197;&#29305;&#27530;&#20540;</span><span style="color: #62686E;"> *)</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">SomethingWrong</span> <span style="color: #f0e68c;">-&gt;</span> 0 
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">MyException</span> <span style="color: #f0e68c;">(</span>i<span style="color: #f0e68c;">,</span>s<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span>  4611686018427387903 
<span style="color: #51afef;">with</span> <span style="color: #62686E;">(*</span><span style="color: #62686E;">&#26681;&#25454;&#36820;&#22238;&#20540;&#30340;&#24418;&#24335;&#26469;&#20915;&#23450;&#21518;&#32493;&#21160;&#20316;</span><span style="color: #62686E;"> *)</span>
<span style="color: #f0e68c;">|</span> 0 <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"something wrong"</span>
<span style="color: #f0e68c;">|</span>  4611686018427387903   <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"div 0"</span>
<span style="color: #f0e68c;">|</span> x <span style="color: #f0e68c;">-&gt;</span> <span style="color: #7bc275;">"result = "</span> <span style="color: #f0e68c;">^</span> string_of_int x
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgd53bc30" class="outline-2">
<h2 id="orgd53bc30"><span class="section-number-2">20.</span> 定义二叉树类型 Binary Tree</h2>
<div class="outline-text-2" id="text-20">
<p>
Leaf表示空节点，即不存放值，仅作为占位使用。
</p>

<p>
Node表示非空节点，是否为叶节点要看它是否有子节点。 
</p>

<p>
叶节点： <code>Node(value,Leaf,Leaf)</code>
非叶节点：左右子节点至少有一个不是 <code>Leaf</code> 
</p>
</div>
