ocaml-book/ocaml-book.org
** 用Tuples表示 | representation with tuples
*** 定义 
#+begin_src ocaml
type 'tp tree = 
|Leaf 
|Node of 'tp * 'tp tree * 'tp tree
;;
#+end_src

*** 创建对象 
#+begin_src ocaml
let a_tree =  Node(2,
  Node(1,Leaf,Leaf),
  Node(3,Leaf,Leaf)
) ;;
#+end_src

*** 使用 
#+begin_src ocaml
let rec size_of_tree t = 
match t with 
|Leaf -> 0
|Node(_,l,r) -> 1 + size_of_tree l + size_of_tree r
;;
#+end_src






** 用Records表示 | representation with records

*** 定义
#+begin_src ocaml
type 'a tree = 
|Leaf
|Node of { v : 'a ; 
           l : 'a tree ; 
           r : 'a tree }
;;
#+end_src
*** 创建对象 
#+begin_src ocaml
  let a_tree = Node {v=2;
		     l= Node{v=1;l=Leaf;r=Leaf};
		     r= Node{v=3;l=Leaf;r=Leaf}
		    } 
  ;;
#+end_src

*** 使用方法，匹配tree对象 

#+begin_src ocaml
  let rec  size_of_tree tr = match tr with 
    | Leaf ->  0
    | Node{v=_;l=a;r=b} -> 1+ size_of_tree a + size_of_tree b 
  ;;
#+end_src

（不要用 =val=  做变量名！）
#+begin_src ocaml
let rec is_member va t = match t with 
|Leaf -> false 
|Node {v=v;l=l;r=r} -> v=va || is_member va l || is_member va r 
;;
#+end_src

先序遍历 preorder traversal

#+begin_src ocaml
  let rec preorder (t :'a tree) :  'a list = 
    match t with 
    |Leaf -> []
    |Node{v=v;l=l;r=r} -> [v] @ preorder l @ preorder r 
  ;;
#+end_src

因append操作 ~@~ 开销太大（线性时间），因此改用 ~::~ 来将每个节点的值加入list

因此用一个输入参数res来记录上一次迭代过程的返回值



#+begin_src 
Node{v=1;l=Leaf;r=Leaf}   ==> [1]

[2;1;3] == 2::[1;3]   => 2::(1::[3])

[mid;l;r] => mid :: [l;r]   => mid::( l::( [r] ) )
#+end_src


先被应用 =preorder()= 的节点 先将值加入 =res= 队首 因此位置最终更靠后。 

#+begin_src ocaml
  let rec preorder (res :'a list)  (t :'a tree) : 'a list = 
    match t with 
    |Leaf -> res  (* 不添加元素到res 即原样返回 *)
    |Node{v=v;l=l;r=r} -> v::(preorder (preorder res r) l)
  ;;
#+end_src



 

* 定义自然数类型 natural numbers

** 定义 nat
#+begin_src ocaml
  type nat = Zero | Nextnum of nat ;;
#+end_src
