ocaml-book/ocaml-book.html

<div id="outline-container-org177eb2b" class="outline-3">
<h3 id="org177eb2b"><span class="section-number-3">20.1.</span> 用Tuples表示 | representation with tuples</h3>
<div class="outline-text-3" id="text-20-1">
</div>
<div id="outline-container-org226ced0" class="outline-4">
<h4 id="org226ced0"><span class="section-number-4">20.1.1.</span> 定义</h4>
<div class="outline-text-4" id="text-20-1-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">'tp tree</span> <span style="color: #f0e68c;">=</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #51afef;">of</span> 'tp <span style="color: #f0e68c;">*</span> 'tp tree <span style="color: #f0e68c;">*</span> 'tp tree
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf5c298" class="outline-4">
<h4 id="orgcf5c298"><span class="section-number-4">20.1.2.</span> 创建对象</h4>
<div class="outline-text-4" id="text-20-1-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">a_tree</span> <span style="color: #f0e68c;">=</span>  <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">(</span>2<span style="color: #f0e68c;">,</span>
  <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">(</span>1<span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">),</span>
  <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">(</span>3<span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">,</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">)</span>
<span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4987d64" class="outline-4">
<h4 id="org4987d64"><span class="section-number-4">20.1.3.</span> 使用</h4>
<div class="outline-text-4" id="text-20-1-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">size_of_tree</span><span style="color: #DFDFDF;"> t</span> <span style="color: #f0e68c;">=</span> 
<span style="color: #51afef;">match</span> t <span style="color: #51afef;">with</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span> <span style="color: #f0e68c;">-&gt;</span> 0
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">(</span>_<span style="color: #f0e68c;">,</span>l<span style="color: #f0e68c;">,</span>r<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-&gt;</span> 1 <span style="color: #f0e68c;">+</span> size_of_tree l <span style="color: #f0e68c;">+</span> size_of_tree r
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>






<div id="outline-container-orgea07192" class="outline-3">
<h3 id="orgea07192"><span class="section-number-3">20.2.</span> 用Records表示 | representation with records</h3>
<div class="outline-text-3" id="text-20-2">
</div>
<div id="outline-container-org46130a2" class="outline-4">
<h4 id="org46130a2"><span class="section-number-4">20.2.1.</span> 定义</h4>
<div class="outline-text-4" id="text-20-2-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">'a tree</span> <span style="color: #f0e68c;">=</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span>
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #51afef;">of</span> <span style="color: #f0e68c;">{</span> v <span style="color: #f0e68c;">:</span> 'a <span style="color: #f0e68c;">;</span> 
           l <span style="color: #f0e68c;">:</span> 'a tree <span style="color: #f0e68c;">;</span> 
           r <span style="color: #f0e68c;">:</span> 'a tree <span style="color: #f0e68c;">}</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c06e68" class="outline-4">
<h4 id="org9c06e68"><span class="section-number-4">20.2.2.</span> 创建对象</h4>
<div class="outline-text-4" id="text-20-2-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">a_tree</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>2<span style="color: #f0e68c;">;</span>
                   l<span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>1<span style="color: #f0e68c;">;</span>l<span style="color: #f0e68c;">=</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">;</span>r<span style="color: #f0e68c;">=</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">};</span>
                   r<span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>3<span style="color: #f0e68c;">;</span>l<span style="color: #f0e68c;">=</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">;</span>r<span style="color: #f0e68c;">=</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span><span style="color: #f0e68c;">}</span>
                  <span style="color: #f0e68c;">}</span> 
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org44a5441" class="outline-4">
<h4 id="org44a5441"><span class="section-number-4">20.2.3.</span> 使用方法，匹配tree对象</h4>
<div class="outline-text-4" id="text-20-2-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span>  <span style="color: #5cEfFF;">size_of_tree</span><span style="color: #DFDFDF;"> tr</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">match</span> tr <span style="color: #51afef;">with</span> 
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Leaf</span> <span style="color: #f0e68c;">-&gt;</span>  0
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>_<span style="color: #f0e68c;">;</span>l<span style="color: #f0e68c;">=</span>a<span style="color: #f0e68c;">;</span>r<span style="color: #f0e68c;">=</span>b<span style="color: #f0e68c;">}</span> <span style="color: #f0e68c;">-&gt;</span> 1<span style="color: #f0e68c;">+</span> size_of_tree a <span style="color: #f0e68c;">+</span> size_of_tree b 
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
（不要用 <code>val</code>  做变量名！）
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">is_member</span><span style="color: #DFDFDF;"> va t</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">match</span> t <span style="color: #51afef;">with</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span> 
<span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Node</span> <span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>v<span style="color: #f0e68c;">;</span>l<span style="color: #f0e68c;">=</span>l<span style="color: #f0e68c;">;</span>r<span style="color: #f0e68c;">=</span>r<span style="color: #f0e68c;">}</span> <span style="color: #f0e68c;">-&gt;</span> v<span style="color: #f0e68c;">=</span>va <span style="color: #f0e68c;">||</span> is_member va l <span style="color: #f0e68c;">||</span> is_member va r 
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
先序遍历 preorder traversal
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">preorder</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">t </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">'a tree</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">:</span>  <span style="color: #FCCE7B;">'a list</span> <span style="color: #f0e68c;">=</span> 
  <span style="color: #51afef;">match</span> t <span style="color: #51afef;">with</span> 
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">[]</span>
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>v<span style="color: #f0e68c;">;</span>l<span style="color: #f0e68c;">=</span>l<span style="color: #f0e68c;">;</span>r<span style="color: #f0e68c;">=</span>r<span style="color: #f0e68c;">}</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #f0e68c;">[</span>v<span style="color: #f0e68c;">]</span> <span style="color: #f0e68c;">@</span> preorder l <span style="color: #f0e68c;">@</span> preorder r 
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
因append操作 <code>@</code> 开销太大（线性时间），因此改用 <code>::</code> 来将每个节点的值加入list
</p>

<p>
因此用一个输入参数res来记录上一次迭代过程的返回值
</p>



<pre class="example">
Node{v=1;l=Leaf;r=Leaf}   ==&gt; [1]

[2;1;3] == 2::[1;3]   =&gt; 2::(1::[3])

[mid;l;r] =&gt; mid :: [l;r]   =&gt; mid::( l::( [r] ) )
</pre>


<p>
先被应用 <code>preorder()</code> 的节点 先将值加入 <code>res</code> 队首 因此位置最终更靠后。 
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">preorder</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">res </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">'a list</span><span style="color: #f0e68c;">)</span><span style="color: #DFDFDF;">  </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">t </span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">'a tree</span><span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">'a list</span> <span style="color: #f0e68c;">=</span> 
  <span style="color: #51afef;">match</span> t <span style="color: #51afef;">with</span> 
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Leaf</span> <span style="color: #f0e68c;">-&gt;</span> res  <span style="color: #62686E;">(* </span><span style="color: #62686E;">&#19981;&#28155;&#21152;&#20803;&#32032;&#21040;res &#21363;&#21407;&#26679;&#36820;&#22238;</span><span style="color: #62686E;"> *)</span>
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Node</span><span style="color: #f0e68c;">{</span>v<span style="color: #f0e68c;">=</span>v<span style="color: #f0e68c;">;</span>l<span style="color: #f0e68c;">=</span>l<span style="color: #f0e68c;">;</span>r<span style="color: #f0e68c;">=</span>r<span style="color: #f0e68c;">}</span> <span style="color: #f0e68c;">-&gt;</span> v<span style="color: #f0e68c;">::(</span>preorder <span style="color: #f0e68c;">(</span>preorder res r<span style="color: #f0e68c;">)</span> l<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>
</div>





<div id="outline-container-org5861bed" class="outline-2">
<h2 id="org5861bed"><span class="section-number-2">21.</span> 定义自然数类型 natural numbers</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org9f952ae" class="outline-3">
<h3 id="org9f952ae"><span class="section-number-3">21.1.</span> 定义 nat</h3>
<div class="outline-text-3" id="text-21-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">type</span> <span style="color: #FCCE7B;">nat</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Zero</span> <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> <span style="color: #51afef;">of</span> nat <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
