ocaml-book/ocaml-book.org
** 创建nat对象
#+begin_src ocaml
  let zero = Zero 
  let one = Nextnum zero 
  let two = Nextnum one 
  let three = Nextnum two 
  let four = Nextnum three ;;
#+end_src

** 操作自然数

*** 是否为0
#+begin_src ocaml
  let is_zero  = function
    | Zero -> true
    | Nextnum _ -> false
  ;;
#+end_src
*** 前驱？
#+begin_src ocaml
  let pred = function
    | Zero -> None
    | Nextnum rest -> Some rest
  ;;
(* ======================= *)
  let pred_e = function
    | Zero -> failwith "pred zero is undefined"
    | Nextnum rest -> rest
  ;;
#+end_src

*** 加法运算
#+begin_src ocaml
  let nat_add n1 n2 = match n1 with
    |Zero -> n2
    |Nextnum x -> nat_add x  (Nextnum n2)
  ;;
#+end_src



*** int和nat的相互转换 

#+begin_src ocaml
  let int_of_nat n = 
    let rec int_of_nat_tr acc  = function
      | Zero -> acc
      | Nextnum x -> int_of_nat_tr (1+acc) x
    in
    int_of_nat_tr 0 n
  ;;
#+end_src


#+begin_src ocaml
  let  nat_of_int i =
    let rec nat_of_int_tr acc =  function
	|n when n = 0  -> acc 
	|n when n > 0 -> nat_of_int_tr (Nextnum acc)  (n-1) 
	|_  -> failwith "n cannot be postived"
    in
    nat_of_int_tr Zero i
  ;;
#+end_src

注意这里模式中使用了 =when= ，因此最后要有一个通配模式 =_= .
否则将会有警告，即使模式包含了在逻辑上存在的所有情况：
#+begin_src ocaml
  .... = function
    |n when n = 0  -> acc 
    |n when n > 0 -> nat_of_int_tr (Nextnum acc)  (n-1) 
    |n when n < 0  -> failwith "n cannot be postived"
  ;;
#+end_src
这种写法仍然会有警告：
#+begin_src
 [partial-match]: this pattern-matching is not exhaustive.
#+end_src







