ocaml-book/ocaml-book.html
<div id="outline-container-orgbaf26df" class="outline-3">
<h3 id="orgbaf26df"><span class="section-number-3">21.2.</span> 创建nat对象</h3>
<div class="outline-text-3" id="text-21-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">zero</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Zero</span> 
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">one</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> zero 
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">two</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> one 
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">three</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> two 
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #DFDFDF;">four</span> <span style="color: #f0e68c;">=</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> three <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org694058b" class="outline-3">
<h3 id="org694058b"><span class="section-number-3">21.3.</span> 操作自然数</h3>
<div class="outline-text-3" id="text-21-3">
</div>
<div id="outline-container-orgd4d94fe" class="outline-4">
<h4 id="orgd4d94fe"><span class="section-number-4">21.3.1.</span> 是否为0</h4>
<div class="outline-text-4" id="text-21-3-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">is_zero</span>  <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Zero</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">true</span>
  <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> _ <span style="color: #f0e68c;">-&gt;</span> <span style="color: #a991f1;">false</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org144a75b" class="outline-4">
<h4 id="org144a75b"><span class="section-number-4">21.3.2.</span> 前驱？</h4>
<div class="outline-text-4" id="text-21-3-2">
<div class="org-src-container">
<pre class="src src-ocaml">  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">pred</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
    <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Zero</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #bbc2cf; background-color: #242730;">None</span>
    <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> rest <span style="color: #f0e68c;">-&gt;</span> <span style="color: #bbc2cf; background-color: #242730;">Some</span> rest
  <span style="color: #ff4500;">;;</span>
<span style="color: #62686E;">(* </span><span style="color: #62686E;">=======================</span><span style="color: #62686E;"> *)</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">pred_e</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
    <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Zero</span> <span style="color: #f0e68c;">-&gt;</span> <span style="color: #C57BDB;">failwith</span> <span style="color: #7bc275;">"pred zero is undefined"</span>
    <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> rest <span style="color: #f0e68c;">-&gt;</span> rest
  <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org48c1d96" class="outline-4">
<h4 id="org48c1d96"><span class="section-number-4">21.3.3.</span> 加法运算</h4>
<div class="outline-text-4" id="text-21-3-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">nat_add</span><span style="color: #DFDFDF;"> n1 n2</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">match</span> n1 <span style="color: #51afef;">with</span>
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Zero</span> <span style="color: #f0e68c;">-&gt;</span> n2
  <span style="color: #f0e68c;">|</span><span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> x <span style="color: #f0e68c;">-&gt;</span> nat_add x  <span style="color: #f0e68c;">(</span><span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> n2<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org05a9e31" class="outline-4">
<h4 id="org05a9e31"><span class="section-number-4">21.3.4.</span> int和nat的相互转换</h4>
<div class="outline-text-4" id="text-21-3-4">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">int_of_nat</span><span style="color: #DFDFDF;"> n</span> <span style="color: #f0e68c;">=</span> 
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">int_of_nat_tr</span><span style="color: #DFDFDF;"> acc</span>  <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
    <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Zero</span> <span style="color: #f0e68c;">-&gt;</span> acc
    <span style="color: #f0e68c;">|</span> <span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> x <span style="color: #f0e68c;">-&gt;</span> int_of_nat_tr <span style="color: #f0e68c;">(</span>1<span style="color: #f0e68c;">+</span>acc<span style="color: #f0e68c;">)</span> x
  <span style="color: #f5deb3; font-weight: bold;">in</span>
  int_of_nat_tr 0 n
<span style="color: #ff4500;">;;</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span>  <span style="color: #5cEfFF;">nat_of_int</span><span style="color: #DFDFDF;"> i</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">nat_of_int_tr</span><span style="color: #DFDFDF;"> acc</span> <span style="color: #f0e68c;">=</span>  <span style="color: #51afef;">function</span>
      <span style="color: #f0e68c;">|</span>n <span style="color: #51afef;">when</span> n <span style="color: #f0e68c;">=</span> 0  <span style="color: #f0e68c;">-&gt;</span> acc 
      <span style="color: #f0e68c;">|</span>n <span style="color: #51afef;">when</span> n <span style="color: #f0e68c;">&gt;</span> 0 <span style="color: #f0e68c;">-&gt;</span> nat_of_int_tr <span style="color: #f0e68c;">(</span><span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> acc<span style="color: #f0e68c;">)</span>  <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> 
      <span style="color: #f0e68c;">|</span>_  <span style="color: #f0e68c;">-&gt;</span> <span style="color: #C57BDB;">failwith</span> <span style="color: #7bc275;">"n cannot be postived"</span>
  <span style="color: #f5deb3; font-weight: bold;">in</span>
  nat_of_int_tr <span style="color: #bbc2cf; background-color: #242730;">Zero</span> i
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
注意这里模式中使用了 <code>when</code> ，因此最后要有一个通配模式 <code>_</code> .
否则将会有警告，即使模式包含了在逻辑上存在的所有情况：
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f0e68c;">....</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">function</span>
  <span style="color: #f0e68c;">|</span>n <span style="color: #51afef;">when</span> n <span style="color: #f0e68c;">=</span> 0  <span style="color: #f0e68c;">-&gt;</span> acc 
  <span style="color: #f0e68c;">|</span>n <span style="color: #51afef;">when</span> n <span style="color: #f0e68c;">&gt;</span> 0 <span style="color: #f0e68c;">-&gt;</span> nat_of_int_tr <span style="color: #f0e68c;">(</span><span style="color: #bbc2cf; background-color: #242730;">Nextnum</span> acc<span style="color: #f0e68c;">)</span>  <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> 
  <span style="color: #f0e68c;">|</span>n <span style="color: #51afef;">when</span> n <span style="color: #f0e68c;">&lt;</span> 0  <span style="color: #f0e68c;">-&gt;</span> <span style="color: #C57BDB;">failwith</span> <span style="color: #7bc275;">"n cannot be postived"</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
<p>
这种写法仍然会有警告：
</p>
<pre class="example">
[partial-match]: this pattern-matching is not exhaustive.
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
